=== CaffSense (10회 이후 예측 + 미래 그래프) ===


--- 0분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 아메리카노
[INFO] +100 mg 추가
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=16, time=9.70s, bpm=99.0
Raw HR = 98.96907216494846, Smoothed HR = 98.96907216494846
S = 0, α = 0.0, β = 0, C = 100.0, R = 0.0
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 1분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=13, time=9.57s, bpm=81.5
Raw HR = 81.53310104529616, Smoothed HR = 90.25108660512231
S = -0.28504349548958324, α = 0.0, β = 0.003014958300537147, C = 99.29583305910546, R = -5.0249305008952454e-05
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 2분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=16, time=9.53s, bpm=100.7
Raw HR = 100.69930069930071, Smoothed HR = 93.73382463651511
S = 0.2595288465182133, α = 0.05190576930364266, β = 0.0012350698858676098, C = 98.98843770522534, R = 5.138029842259233
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 3분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=13, time=9.50s, bpm=82.1
Raw HR = 82.10526315789474, Smoothed HR = 88.1125549674972
S = -0.4057551595583858, α = 0.04931048083846052, β = 0.002008231115321629, C = 98.67209038465496, R = 4.8654678106476075
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 4분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=15, time=9.47s, bpm=95.1
Raw HR = 95.07042253521126, Smoothed HR = 92.62499546413557
S = 0.31122984198888815, α = 0.10169435306854605, β = 0.0009155788975848706, C = 98.3420997851467, R = 10.000775178459723
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 5분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=11, time=9.47s, bpm=69.7
Raw HR = 69.71830985915493, Smoothed HR = 82.29799851742031
S = -0.2589069638968282, α = 0.09660963541511874, β = 0.001643393765805582, C = 97.43995894360204, R = 9.413501958925048
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 6분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=14, time=9.60s, bpm=87.5
Raw HR = 87.5, Smoothed HR = 84.0962441314554
S = 0.09721659850515585, α = 0.09673102803312617, β = 0.001245557772223941, C = 97.0244100059009, R = 9.385146368401104
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 7분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=12, time=9.63s, bpm=74.7
Raw HR = 74.74048442906575, Smoothed HR = 77.31959809607356
S = -0.5134725500578946, α = 0.09189447663146985, β = 0.0017150352565422778, C = 96.72900298980673, R = 8.888661017385575
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 8분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=15, time=9.67s, bpm=93.1
Raw HR = 93.10344827586208, Smoothed HR = 85.11464423497594
S = 0.2947532901888189, α = 0.13246623934293966, β = 0.000885104678034545, C = 96.13975951503969, R = 12.735154380334837
[수면 예측] → 최소 10회 측정 후 예측 가능합니다.

종료하려면 'q' 입력: 
1분 대기...


--- 9분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=18, time=9.70s, bpm=111.3
Raw HR = 111.34020618556701, Smoothed HR = 85.11464423497594
S = 0.0, α = 0.12584292737579267, β = 0.0008200078581382231, C = 95.839773408139, R = 12.06063464353414
[수면 예측] 매우 장시간 동안 불가

종료하려면 'q' 입력: 
1분 대기...


--- 10분 경과 측정 ---

섭취 음료? (아메리카노 / 엔터): 
심박 측정 준비하세요!
3
2
1
측정 시작!

[HW_605] beats=17, time=9.63s, bpm=105.9
Raw HR = 105.88235294117648, Smoothed HR = 91.24209521536811
S = 0.4643416609616854, α = 0.1935426740929712, β = 0.0004124212978958928, C = 95.54801036324045, R = 18.4925486930815
[수면 예측] 매우 장시간 동안 불가
